DEFINE GROUP(BANKDEMO) DESCRIPTION(SYNTHETIC BANK DEMO)
DEFINE PROGRAM(ACCTINQ) GROUP(BANKDEMO) LANGUAGE(COBOL) DATALOCATION(ANY)
DEFINE TRANSACTION(BA01) GROUP(BANKDEMO) PROGRAM(ACCTINQ) STATUS(ENABLED)
DEFINE MAPSET(ACCTMAP) GROUP(BANKDEMO) RESIDENT(NO) STATUS(ENABLED)
