//SURVMON JOB (ACCT),'SURV BENEFITS',CLASS=A,MSGCLASS=H,
//             NOTIFY=&SYSUID
//* MONTH-END SURVIVOR INCOME BENEFIT CALCULATION
// SET RUNDATE=20260831
// SET RUNID=SRV202608001
//MONTHLY EXEC SURVBAT,RUNDATE=&RUNDATE,RUNID=&RUNID
//MONTHLY.CALC.RUNCTL DD *
20260831SRV202608001
/*
//PAYRPT  EXEC PGM=SORT,COND=(8,LE)
//SYSOUT   DD SYSOUT=*
//SORTIN   DD DISP=SHR,DSN=DEV1.SURVDEMO.PAY.&RUNID
//SORTOUT  DD DISP=(NEW,CATLG,DELETE),
//            DSN=DEV1.SURVDEMO.RPT.&RUNID,
//            SPACE=(TRK,(2,1),RLSE),
//            DCB=(RECFM=FB,LRECL=120,BLKSIZE=0)
//SYSIN    DD DISP=SHR,DSN=DEV1.SURVDEMO.CNTL(PAYSORT)
//
