000100 ACCTMAP DFHMSD TYPE=&SYSPARM,MODE=INOUT,LANG=COBOL,             X
000200                TIOAPFX=YES,STORAGE=AUTO,CTRL=(FREEKB,FRSET)
000300 ACCTSCR DFHMDI SIZE=(24,80),LINE=1,COLUMN=1
000400          DFHMDF POS=(1,24),LENGTH=32,ATTRB=(ASKIP,BRT),          X
000500                INITIAL='BANKDEMO ACCOUNT INQUIRY'
000600          DFHMDF POS=(3,2),LENGTH=11,ATTRB=(ASKIP),              X
000700                INITIAL='ACCOUNT ID:'
000800 ACCTID   DFHMDF POS=(3,14),LENGTH=10,ATTRB=(UNPROT,IC,FSET)
000900          DFHMDF POS=(5,2),LENGTH=14,ATTRB=(ASKIP),              X
001000                INITIAL='CUSTOMER NAME:'
001100 CUSTNM   DFHMDF POS=(5,18),LENGTH=30,ATTRB=(ASKIP)
001200          DFHMDF POS=(7,2),LENGTH=13,ATTRB=(ASKIP),              X
001300                INITIAL='ACCOUNT TYPE:'
001400 TYPE     DFHMDF POS=(7,18),LENGTH=3,ATTRB=(ASKIP)
001500          DFHMDF POS=(9,2),LENGTH=8,ATTRB=(ASKIP),               X
001600                INITIAL='BALANCE:'
001700 BALANCE  DFHMDF POS=(9,18),LENGTH=15,ATTRB=(ASKIP)
001800          DFHMDF POS=(11,2),LENGTH=7,ATTRB=(ASKIP),              X
001900                INITIAL='STATUS:'
002000 STATUS   DFHMDF POS=(11,18),LENGTH=10,ATTRB=(ASKIP)
002100 MESSAGE  DFHMDF POS=(20,2),LENGTH=60,ATTRB=(ASKIP,BRT)
002200          DFHMDF POS=(23,2),LENGTH=28,ATTRB=(ASKIP),             X
002300                INITIAL='ENTER=INQUIRE  PF3=EXIT'
002400          DFHMSD TYPE=FINAL
002500          END
