000100 01  PAYMENT-HOST-VARIABLES.
000200     05  HV-PAYMENT-ID              PIC X(12).
000300     05  HV-COMPANY-CODE            PIC X(4).
000400     05  HV-BENEFICIARY-ID          PIC X(10).
000500     05  HV-PAYMENT-METHOD          PIC X(3).
000600     05  HV-CURRENCY                PIC X(3).
000700     05  HV-AMOUNT                  PIC S9(11)V99 COMP-3.
000800     05  HV-EFFECTIVE-DATE          PIC X(10).
000900     05  HV-DEBIT-ACCOUNT           PIC X(12).
001000     05  HV-BENEFICIARY-NAME        PIC X(60).
001100     05  HV-BANK-ROUTING            PIC X(9).
001200     05  HV-BANK-ACCOUNT            PIC X(17).
001300     05  HV-BANK-COUNTRY            PIC X(2).
001400     05  HV-END-TO-END-ID           PIC X(20).
001500     05  HV-PAYMENT-STATUS          PIC X(1).
001600         88  HV-PAYMENT-APPROVED    VALUE 'A'.
001700         88  HV-PAYMENT-SENT        VALUE 'S'.
001800         88  HV-PAYMENT-SETTLED     VALUE 'T'.
001900         88  HV-PAYMENT-REJECTED    VALUE 'R'.
002000         88  HV-PAYMENT-EXCEPTION   VALUE 'E'.
002100     05  HV-BANK-TRACE              PIC X(15).
002200     05  HV-BANK-TRACE-IND          PIC S9(4) COMP.
002300     05  HV-VERSION-NO              PIC S9(9) COMP.
