//TRSYPAY  JOB (TRSY),'TREASURY PAYMENTS',CLASS=A,MSGCLASS=X,
//             NOTIFY=&SYSUID,REGION=0M
//* EXTRACT APPROVED USD PAYMENTS AND BUILD THE BANK FILE.
//EXTRACT  EXEC PGM=IKJEFT01,DYNAMNBR=20
//STEPLIB  DD DSN=DEV1.TRSYDEMO.LOAD,DISP=SHR
//         DD DSN=DB2T.SDSNLOAD,DISP=SHR
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSTSIN  DD *
  DSN SYSTEM(DB2T)
  RUN PROGRAM(PAYEXTR) PLAN(TRSYPLAN) LIB('DEV1.TRSYDEMO.LOAD')
  END
/*
//RUNCTL   DD *
20260723B20260723001
/*
//DISBOUT  DD DSN=TRSY.DAILY.DISBURSE(+1),
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(CYL,(5,2),RLSE),
//            DCB=(RECFM=FB,LRECL=120,BLKSIZE=0)
//EXCEPT   DD DSN=TRSY.DAILY.PAYEXC(+1),
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(CYL,(2,1),RLSE),
//            DCB=(RECFM=FB,LRECL=120,BLKSIZE=0)
//* BANK TRANSMISSION IS RELEASED ONLY FOR RC 0 OR 4.
// IF (EXTRACT.RC LE 4) THEN
//XMITFLAG EXEC PGM=IEFBR14
//READY    DD DSN=TRSY.DAILY.READY(+1),
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(TRK,(1,1)),
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)
// ENDIF
