DEFINE PROGRAM(SURVINQ) GROUP(SURVAPP) LANGUAGE(COBOL)
       DESCRIPTION(SURVIVOR BENEFIT INQUIRY)
DEFINE PROGRAM(SURVVALID) GROUP(SURVAPP) LANGUAGE(COBOL)
       DESCRIPTION(SURVIVOR BENEFIT VALIDATION)
DEFINE MAPSET(SURVMAP) GROUP(SURVAPP)
       DESCRIPTION(SURVIVOR BENEFIT INQUIRY MAP)
DEFINE TRANSACTION(SI01) GROUP(SURVAPP) PROGRAM(SURVINQ)
       DESCRIPTION(SURVIVOR INCOME BENEFIT INQUIRY)
       TASKDATALOC(ANY)
INSTALL GROUP(SURVAPP)
