//BANKBAT PROC INFILE=,AUDIT=,REJECT=
//POST    EXEC PGM=IKJEFT01,DYNAMNBR=20,REGION=0M
//STEPLIB  DD DSN=DEV1.BANKDEMO.LOAD,DISP=SHR
//         DD DSN=DB2T.SDSNLOAD,DISP=SHR
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSTSIN  DD *
  DSN SYSTEM(DB2T)
  RUN PROGRAM(TXNPOST) PLAN(BANKPLAN) LIB('DEV1.BANKDEMO.LOAD')
  END
/*
//TXNIN    DD DSN=&INFILE,DISP=SHR
//AUDITOUT DD DSN=&AUDIT,
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(CYL,(5,2),RLSE),
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)
//REJECT   DD DSN=&REJECT,
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(CYL,(2,1),RLSE),
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)
//SYSIN    DD DUMMY
//         PEND
