//SURVBAT PROC RUNDATE=,RUNID=
//* MONTHLY SURVIVOR BENEFIT CALCULATION PROCEDURE
//CALC     EXEC PGM=SURVCALC,REGION=0M
//STEPLIB  DD DISP=SHR,DSN=DEV1.SURVDEMO.LOAD
//RUNCTL   DD DUMMY
//PAYOUT   DD DISP=(NEW,CATLG,DELETE),
//            DSN=DEV1.SURVDEMO.PAY.&RUNID,
//            SPACE=(TRK,(5,2),RLSE),
//            DCB=(RECFM=FB,LRECL=120,BLKSIZE=0)
//EXCEPT   DD DISP=(NEW,CATLG,DELETE),
//            DSN=DEV1.SURVDEMO.EXC.&RUNID,
//            SPACE=(TRK,(2,1),RLSE),
//            DCB=(RECFM=FB,LRECL=120,BLKSIZE=0)
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
// PEND
